# Exploring a database

Let's practice on Pandas. Download the dataset `chipotle.csv` from JULIE and upload it to your workspace.

1. Import a library that allows to read data from a csv file

In [86]:
import pandas as pd
import numpy as np

2. Import the dataset

In [87]:
df = pd.read_csv("chipotle.csv")

In [88]:
# affiche le nombre d'élément du tableau
df.shape

(4622, 6)

In [89]:
df.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [90]:
# DataFrame.describe(percentiles=None, include=None, exclude=None)
df.describe()

        Unnamed: 0     order_id     quantity
count  4622.000000  4622.000000  4622.000000
mean   2310.500000   927.254868     1.075725
std    1334.400802   528.890796     0.410186
min       0.000000     1.000000     1.000000
25%    1155.250000   477.250000     1.000000
50%    2310.500000   926.000000     1.000000
75%    3465.750000  1393.000000     1.000000
max    4621.000000  1834.000000    15.000000

In [91]:
df = pd.read_csv("chipotle.csv", index_col=0)
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [92]:
# index attribut
print(df.index)

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       4612, 4613, 4614, 4615, 4616, 4617, 4618, 4619, 4620, 4621],
      dtype='int64', length=4622)

In [93]:
# Accessing an item in the series via the index: similar operation to lists
print(df[:2])

   order_id  quantity                     item_name choice_description  \
0         1         1  Chips and Fresh Tomato Salsa                NaN
1         1         1                          Izze       [Clementine]

  item_price
0     $2.39
1     $3.39

3. Look at the 10 first rows in the dataset

In [94]:
print(df[:10])

   order_id  quantity                              item_name  \
0         1         1           Chips and Fresh Tomato Salsa
1         1         1                                   Izze
2         1         1                       Nantucket Nectar
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl
5         3         1                           Chicken Bowl
6         3         1                          Side of Chips
7         4         1                          Steak Burrito
8         4         1                       Steak Soft Tacos
9         5         1                          Steak Burrito

                                  choice_description item_price
0                                                NaN     $2.39
1                                       [Clementine]     $3.39
2                                            [Apple]     $3.39
3                                                NaN     $2.39
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
5  [Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...    $10.98
6                                                NaN     $1.69
7  [Tomatillo Red Chili Salsa, [Fajita Vegetables...    $11.75
8  [Tomatillo Green Chili Salsa, [Pinto Beans, Ch...     $9.25
9  [Fresh Tomato Salsa, [Rice, Black Beans, Pinto...     $9.25

In [95]:
# affiche les 10 première lignes du Dataframe
df.iloc[:10]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

4. What is the shape of the dataset ?

In [96]:
shape = df.shape
print('\nDataFrame Shape :', shape)
print('\nNumber of rows :', shape[0])
print('\nNumber of columns :', shape[1])

DataFrame Shape : (4622, 5)

Number of rows : 4622

Number of columns : 5

5. Display all the columns of our dataset

In [97]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [98]:
# afficher les valeurs des noms de colonnes avec .iloc
df.iloc[:0,:]

Empty DataFrame
Columns: [order_id, quantity, item_name, choice_description, item_price]
Index: []

In [99]:
print(df.columns.tolist())

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [100]:
display(df[:0])

Empty DataFrame
Columns: [order_id, quantity, item_name, choice_description, item_price]
Index: []

6. What is the most ordered item?

     *Indication: we will use GROUP BY & Sort_values()*

In [101]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [102]:
ventes_par_article = df.groupby('item_name')['quantity'].sum()

ventes_par_article_triees = ventes_par_article.sort_values(ascending = False)

plus_vendus = ventes_par_article_triees[ventes_par_article_triees == ventes_par_article_triees.iloc[0]]

print(plus_vendus)

item_name
Chicken Bowl    761
Name: quantity, dtype: int64

7. How many items were ordered from Chipotle in total?

In [103]:
# Jedha solution
df['quantity'].sum()

4972

In [104]:
somme_order_id = df['quantity'].sum()

print("La somme des order_id est :", somme_order_id)

La somme des order_id est : 4972

8. How much revenue has Chipotle made?
      
      A. Convert item_price to a decimal number.
        1. Look at dataset [ item_price ], what do you see?
        2. Let's find a way to get that $ out of our way. We can do that by using [str](https://bit.ly/2ClcdtN)
        3. Let's now convert the series to float instead of string
        
    B. Multiply the quantity sold by the price of the item.
    
    C. Add it all up, how much do you find?
    
    D. Round to two decimal places.
    
    We can use the [Series.round()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.round.html#pandas.Series.round) function.

A. Convertissez 'item_price' en un nombre décimal.

In [105]:
type("item_price")

str

In [107]:
# efface le signe $ dans la colonne
df["item_price"] = df["item_price"].str.replace("$","")

In [108]:
# transforme en Float les éléments de la colonne
df["item_price"] = df["item_price"].astype("float")

In [111]:
# multiplie la quantité par le prix
total = df["item_price"]*df["quantity"]

In [112]:
# faire la somme et arrondir à 2 décimal
total.sum().round(2)

39237.02

9. What is the average revenue per order?

In [113]:
# les revenus par
df["revenue"] = df["quantity"] * df["item_price"]

In [114]:
df["revenue"]

0        2.39
1        3.39
2        3.39
3        2.39
4       33.96
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: revenue, Length: 4622, dtype: float64

In [115]:
df.groupby("order_id")["revenue"].sum()

order_id
1       11.56
2       33.96
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: revenue, Length: 1834, dtype: float64

In [116]:
df.groupby("order_id")["revenue"].sum().mean()

21.39423118865867